'''Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.'''

my_list = ['Hello our Dear Teacher', 1, (1, 2, 3), [7, 8, 9]] #почему-то не работает
print(type(my_list [0], my_list [1], my_list [2], my_list [3]))


